<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"6e96e66f985b6a46f7b5aac536288aa4205318f44bc15b8b6a3bc8801e259989","plan_job_ref":"Job Create terraform plan #33 at https://github.com/paulsilcock/gke-terraform/actions/runs/3631773639","plan_hash":"b5f9ea6cedfa8c259deb5498d694c2aa2df3351b11c99a693fc9a344d4ba6776","plan_text_format":"text","version":"1.31.1"} -->
Terraform plan in __terraform__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project_iam_binding.registry-write will be created
  + resource "google_project_iam_binding" "registry-write" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = "gothic-album-364814"
      + role    = "roles/artifactregistry.writer"
    }

  # google_service_account.registry will be created
  + resource "google_service_account" "registry" {
      + account_id   = "********"
      + disabled     = false
      + display_name = "Publish artifacts"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ cluster_ingress_ip = {
        id                 = "projects/gothic-album-364814/regions/europe-west2/addresses/ingress-nginx-lb"
        name               = "ingress-nginx-lb"
      ~ users              = [
          - "https://www.googleapis.com/compute/beta/projects/gothic-album-364814/zones/europe-west2-a/instances/gke-k8s-cluster-k8s-cluster-ingress-n-6f47d5b2-0mnt",
          + "https://www.googleapis.com/compute/beta/projects/gothic-album-364814/zones/europe-west2-a/instances/gke-k8s-cluster-k8s-cluster-ingress-n-6f47d5b2-d2wk",
        ]
        # (15 unchanged elements hidden)
    }

Invalid attribute in provider configuration

  with provider["registry.terraform.io/hashicorp/kubernetes"],
  on provider.tf line 24, in provider "kubernetes":
  24: provider "kubernetes" {

'host' is not a valid URL
```
</details>

:memo: Plan generated in [Create terraform plan #33](https://github.com/paulsilcock/gke-terraform/actions/runs/3631773639)